//描述
//从键盘输入一个整数，请你判断这个整数能被 2 3 7 中哪几个数整除，并按升序输出。如果不能被 2 3 7 任意一个数整除则输出 n。
//输入描述：
//输入一个整数
//输出描述：
//输出能被 2 3 7 哪几个数整除，并按升序输出。

//第一版
#include <stdio.h>

int main() {
    int n;
    scanf("%d", &n);
    if (n % 2 != 0 && n % 3 != 0 && n % 7 != 0) {
        printf("n");
    }
    if (n % 2 == 0) {
        n = n / 2;
        printf("2 ");
    }
    if (n % 3 == 0) {
        n = n / 3;
        printf("3 ");
    }
    if (n % 7 == 0) {
        n = n / 7;
        printf("7 ");
    }
    return 0;
}

//第二版
int main()
{
	int a;
	//这个是输入的变量
	int c ;
	//这个是循环控制变量
	int d = 0;
	//这个是输出计数器
	int arr[3] = { 2,3,7 };
	//把被除数存到数组里去
	scanf("%d", &a);

	for (c=0; c < 3; c++)
	{
		if (a % arr[c] == 0)
		{
			printf("%d ", arr[c]);
			d++;
		}
	}
	//循环整除三次，如果有任何一次命中了判断，那么d+1之后就不会命中下面的判断了
	if (d == 0)
	{
		printf("n ");
	}
	
	return 0;
}
